app/controllers/admins_controller.rb

  def dashboard

  @administrators=Administrator.all
  @bookmarks =Bookmark.all
@bookmarks=Bookmark.paginate(:page => params[:page], :per_page => 3)
@administrators=Administrator.paginate(:page => params[:page], :per_page => 3)
---
SELECT `administrators`.* FROM `administrators`
SELECT `bookmarks`.* FROM `bookmarks`
SELECT COUNT(*) FROM `bookmarks`
SELECT `bookmarks`.* FROM `bookmarks` LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `administrators`
SELECT `administrators`.* FROM `administrators` LIMIT 3 OFFSET 0