app/controllers/administrators_controller.rb

INSERT INTO `administrators` (`username`, `password`, `mail`, `role`, `created_at`, `updated_at`) VALUES ('', 'malli123', 'malli', 'co-admin', '2011-09-13 06:24:17', '2011-09-13 06:24:17')
---
  def create
 @administrator=Administrator.new(params[:administrator])
  @administrator.save

SELECT `administrators`.* FROM `administrators`
---
  def index

  @administrators=Administrator.all