app/controllers/bookmarks_controller.rb

  def create

  @bookmark=Bookmark.new(params[:bookmark])

  @bookmark.save
---
INSERT INTO `bookmarks` (`title`, `description`, `created_at`, `updated_at`) VALUES (NULL, NULL, '2011-09-09 11:04:53', '2011-09-09 11:04:53')

  def index
@bookmarks=Bookmark.all
@bookmarks=Bookmark.paginate(:page => params[:page], :per_page => 3)
---
SELECT `bookmarks`.* FROM `bookmarks`
SELECT COUNT(*) FROM `bookmarks`
SELECT `bookmarks`.* FROM `bookmarks` LIMIT 30 OFFSET 0

  def edit
  @bookmark=Bookmark.find(params[:id])
---
SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 3 LIMIT 1

  def show
 @bookmark = Bookmark.find(params[:id])
---
SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 4 LIMIT 1

  def destroy
  @bookmark=Bookmark.find(params[:id])
  @bookmark.destroy
---
SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 8 LIMIT 1
DELETE FROM `bookmarks` WHERE `bookmarks`.`id` = 8