app/controllers/credentials_controller.rb

  def create
 @credential=Credential.new(params[:credential])
 @credential.save
---
INSERT INTO `credentials` (`username`, `mail`, `password`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, '2011-09-09 12:40:13', '2011-09-09 12:40:13')

  def index
@credentials=Credential.all
---
SELECT `credentials`.* FROM `credentials`