app/controllers/guests_controller.rb

SELECT `bookmarks`.* FROM `bookmarks`
SELECT COUNT(*) FROM `bookmarks`
SELECT `bookmarks`.* FROM `bookmarks` LIMIT 3 OFFSET 0
SELECT `administrators`.* FROM `administrators` LIMIT 3
---
  def dashboard
@bookmarks=Bookmark.all
@bookmarks=Bookmark.paginate(:page => params[:page], :per_page => 3)
@administrators=Administrator.limit(3)

SELECT `bookmarks`.* FROM `bookmarks`
SELECT COUNT(*) FROM `bookmarks`
SELECT `bookmarks`.* FROM `bookmarks` LIMIT 3 OFFSET 0
SELECT `administrators`.* FROM `administrators` LIMIT 3
---
  def index

  @bookmarks=Bookmark.all
@bookmarks=Bookmark.paginate(:page => params[:page], :per_page => 3)
@administrators=Administrator.limit(3)

SELECT `bookmarks`.* FROM `bookmarks`
---
  def view_all

  @bookmarkss=Bookmark.all