app/controllers/login_controller.rb

def create

   @administrator = Administrator.new(params[:administrator])
 puts "###################################################",params
   @admin = Administrator.find_by_username_and_password(@administrator.username,@administrator.password)
---
SELECT `administrators`.* FROM `administrators` WHERE `administrators`.`username` = 'malli' AND `administrators`.`password` = 'malli123' LIMIT 1