app/controllers/users_controller.rb

SELECT `bookmarks`.* FROM `bookmarks`
SELECT COUNT(*) FROM `bookmarks`
SELECT `bookmarks`.* FROM `bookmarks` LIMIT 3 OFFSET 0
---
  def index
@bookmarks=Bookmark.all
@bookmarks=Bookmark.paginate(:page => params[:page], :per_page => 3)